app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "dffgf"], ["text", "dsfdsf"], ["created_at", "2021-10-29 22:50:35.693416"], ["updated_at", "2021-10-29 22:50:35.693416"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "text" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["text", "dsfdsfg"], ["updated_at", "2021-10-29 22:51:42.904199"], ["id", 1]]